start = '. Я ChatGPT в telegram!\n' \
        '\n' \
        'Ежедневно вам доступно 3000 символов для того чтобы задавать мне вопросы.\n' \
        '\n' \
        'Если я долго отвечаю - не беспокойтесь, я обрабатываю информацию и вскоре вам отвечу.\n' \
        'Скорость моих ответов зависит от загруженности сервера (вопросы на английском языке обрабатываю быстрее).\n' \
        '\n' \
        'Задавайте вопросы корректно, чем меньше грамматических ошибок в запросе, тем лучше мой ответ.\n' \
        "Не забывайте ставить '?' в конце вопросительного предложения\n" \
        '\n' \
        'Пример НЕ правильного вопроса: \n' \
        '\n' \
        'Как заработать денег?\n' \
        '\n' \
        'Примеры правильных вопросов: \n' \
        '\n' \
        'Как я могу начать зарабатывать на дропшиппинге ?\n' \
        '\n' \
        'Распиши поэтапный план заработка на дропшиппинге ?\n' \
        '\n' \
        'Не спамте в чат, если не хотите получить бан на всегда\n' \
        '\n'

help_msg = 'Я могу ответить на любой ваш вопрос!\n' \
           '\n' \
           'Я общаюсь с вами как обычный человек, но если вы хотите получить подробный ответ в определенной ' \
           'сфере - \n' \
           'Заставьте меня думать, что я профессионал этого дела.\n' \
           '\n' \
           'Пример:\n' \
           '\n' \
           'Представь, что ты фитнес тренер, напиши пошаговый план тренировок.\n' \
           '\n' \
           'Вы можете оформить подписку, с ее помощью вы получаете неограниченное кол-во символов и откроете мою ' \
           'возможность создания изображений по вашему описанию.\n' \
           '\n' \
           "Так же существуют сайты с prompt'тами, они позволят вам правильно задать вопрос.\n" \
           "Prompt - ваш правильно заданный вопрос.\n" \
           "Если вы научитесь создавать правильные prompt'ты вы сможете их продавать!\n" \
           '\n' \
           'Что бы узнать информацию о своем аккаунте "/profile"\n' \
           '\n' \
           'Идеи, недовольства, баги сюда: @Dive_into_dev\n'

follower = 'Поздравляю с оформление подписки!!!\n' \
           '\n' \
           'Вы можете использовать мой полный функционал.\n' \
           '\n' \
           'Теперь вы владеете бесконечным количеством символов и созданием изображений.\n' \
           '\n' \
           'Изображения создаются за счет нейросеть Dall-E\n' \
           '\n' \
           'Пример ввода:\n' \
           '\n' \
           '!Горы в тумане\n' \
           '\n' \
           'Для полной точности изображения вводите текст на английском и описывайте изображения в деталях!\n' \
           '\n' \
           'Подписка закончится через месяц'

MESSAGE = {
    'start': start,
    'help': help_msg,
    'follower': follower,
}
